apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_ccfg.h
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_SHIFT    (0)       /* Bits 0-7: Reserved for future use */
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_MASK     (0xff << CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_SHIFT)
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_SHIFT    (8)       /* Bits 8-15: Reserved for future use */
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_MASK     (0xff << CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_SHIFT)
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_SHIFT   (16)      /* Bits 16-23: Reserved for future use */
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_MASK    (0xff << CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_SHIFT)
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_SHIFT   (24)      /* Bits 24-31: Reserved for future use */
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_MASK    (0xff << CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_SHIFT)

/* TIVA_CCFG_RTC_OFFSET */

#define CCFG_RTC_OFFSET_RTC_COMP_P0_SHIFT       (16)      /* Bits 16-31: Reserved for future use */
#define CCFG_RTC_OFFSET_RTC_COMP_P0_MASK        (0xffff << CCFG_RTC_OFFSET_RTC_COMP_P0_SHIFT)
#define CCFG_RTC_OFFSET_RTC_COMP_P1_SHIFT       (8)       /* Bits 8-15: Reserved for future use */
#define CCFG_RTC_OFFSET_RTC_COMP_P1_MASK        (0xff << CCFG_RTC_OFFSET_RTC_COMP_P1_SHIFT)
#define CCFG_RTC_OFFSET_RTC_COMP_P2_SHIFT       (0)       /* Bits 0-7: Reserved for future use */
#define CCFG_RTC_OFFSET_RTC_COMP_P2_MASK        (0xff << CCFG_RTC_OFFSET_RTC_COMP_P2_SHIFT)

/* TIVA_CCFG_FREQ_OFFSET */

#define CCFG_FREQ_OFFSET_HF_COMP_P2_SHIFT       (0)       /* Bits 0-7: Reserved for future use */
#define CCFG_FREQ_OFFSET_HF_COMP_P2_MASK        (0xff << CCFG_FREQ_OFFSET_HF_COMP_P2_SHIFT)
#define CCFG_FREQ_OFFSET_HF_COMP_P1_SHIFT       (8)       /* Bits 8-15: Reserved for future use */
#define CCFG_FREQ_OFFSET_HF_COMP_P1_MASK        (0xff << CCFG_FREQ_OFFSET_HF_COMP_P1_SHIFT)
#define CCFG_FREQ_OFFSET_HF_COMP_P0_SHIFT       (16)      /* Bits 16-31: Reserved for future use */
#define CCFG_FREQ_OFFSET_HF_COMP_P0_MASK        (0xffff << CCFG_FREQ_OFFSET_HF_COMP_P0_SHIFT)

/* TIVA_CCFG_IEEE_MAC_0 (32-bit value) */
/* TIVA_CCFG_IEEE_MAC_1 (32-bit value) */
/* TIVA_CCFG_IEEE_BLE_0 (32-bit value) */
/* TIVA_CCFG_IEEE_BLE_1 (32-bit value) */

/* TIVA_CCFG_BL_CONFIG */

#define CCFG_BL_CONFIG_BL_ENABLE_SHIFT          (0)       /* Bits 0-7: Enables the boot loader backdoor */
#define CCFG_BL_CONFIG_BL_ENABLE_MASK           (0xff << CCFG_BL_CONFIG_BL_ENABLE_SHIFT)
#  define CCFG_BL_CONFIG_BL_ENABLE              (0xc5 << CCFG_BL_CONFIG_BL_ENABLE_SHIFT)
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_SHIFT      (8)       /* Bits 8-15:  DIO number that is level checked
                                                           * if the boot loader backdoor is enabled */
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_MASK       (0xff << CCFG_BL_CONFIG_BL_PIN_NUMBER_SHIFT)
#define CCFG_BL_CONFIG_BL_LEVEL                 (1 << 16) /* Bit 16: Active level of the selected DIO */
#  define CCFG_BL_CONFIG_BL_LOW                 (0)
#  define CCFG_BL_CONFIG_BL_HIGH                CCFG_BL_CONFIG_BL_LEVEL
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_SHIFT  (24)      /* Bits 24-31: Bootloader enable */
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_MASK   (0xff << CCFG_BL_CONFIG_BOOTLOADER_ENABLE_SHIFT)
#  define CCFG_BL_CONFIG_BOOTLOADER_ENABLE      (0xc5 << CCFG_BL_CONFIG_BOOTLOADER_ENABLE_SHIFT)

/* TIVA_CCFG_O_ERASE_CONF */

#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N        (1 << 0)  /* Bit 0: Bank erase */
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N        (1 << 8)  /* Bit 8: Chip erase */

/* TIVA_CCFG_CCFG_TI_OPTIONS */

#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_SHIFT (0)       /* Bits 0-7: Enable TI Failure Analysis */
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_MASK  (0xff << CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_SHIFT)
#  define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE     (0xc5 << CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_SHIFT)

/* TIVA_CCFG_CCFG_TAP_DAP_0 */

#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_SHIFT    (0)       /* Bits 0-7: Enable Test TAP */
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_MASK     (0xff << CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_SHIFT)
#  define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE        (0xc5 << CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_SHIFT)
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_SHIFT    (8)       /* Bits 8-15: Enable PRCM TAP */
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_MASK     (0xff << CCFG_CCFG_TAP_DAP_0_PWRPROF_TAP_ENABLE_SHIFT)
#  define CCFG_CCFG_TAP_DAP_0_PWRPROF_TAP_ENABLE     (0xc5 << CCFG_CCFG_TAP_DAP_0_PWRPROF_TAP_ENABLE_SHIFT)
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_SHIFT     (16)       /* Bits 16-23: Enable CPU DAP */
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_MASK      (0xff << CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_SHIFT)
#  efine CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE          (0xc5 << CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_SHIFT)

/* TIVA_CCFG_CCFG_TAP_DAP_1 */

#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_SHIFT  (16)       /* Bits 16-23: Enable PBIST2 TAP */
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_MASK   (0xff << CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_SHIFT)
#  define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE      (0xc5 << CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_SHIFT)
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_SHIFT  (8)       /* Bits 8-15: Enable PBIST1 TAP */
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_MASK   (0xff << CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_SHIFT)
#  define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE      (0xc5 << CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_SHIFT)
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_SHIFT     (0)       /* Bits 0-7: Enable WUC TAP */
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_MASK      (0xff << CCFG_CCFG_TAP_DAP_1_AON_TAP_ENABLE_SHIFT)
#  define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE         (0xc5 << CCFG_CCFG_TAP_DAP_1_AON_TAP_ENABLE_SHIFT)

/* TIVA_CCFG_IMAGE_VALID_CONF (32-bit value) */

/* TIVA_CCFG_CCFG_PROT_31_0 */

#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC(n)      (1 << (n))
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0     (1 << 0)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1     (1 << 1)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2     (1 << 2)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3     (1 << 3)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4     (1 << 4)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5     (1 << 5)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6     (1 << 6)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7     (1 << 7)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8     (1 << 8)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9     (1 << 9)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10    (1 << 10)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11    (1 << 11)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12    (1 << 12)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13    (1 << 13)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14    (1 << 14)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15    (1 << 15)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16    (1 << 16)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17    (1 << 17)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18    (1 << 18)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19    (1 << 19)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20    (1 << 20)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21    (1 << 21)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22    (1 << 22)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23    (1 << 23)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24    (1 << 24)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25    (1 << 25)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26    (1 << 26)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27    (1 << 27)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28    (1 << 28)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29    (1 << 29)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30    (1 << 30)
#  define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31    (1 << 31)

/* TIVA_CCFG_CCFG_PROT_63_32 */

#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC(n)     (1 << ((n) - 32))
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_32   (1 << 0)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_33   (1 << 1)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_34   (1 << 2)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_35   (1 << 3)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_36   (1 << 4)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_37   (1 << 5)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_38   (1 << 6)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_39   (1 << 7)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_40   (1 << 8)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_41   (1 << 9)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_42   (1 << 10)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_43   (1 << 11)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_44   (1 << 12)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_45   (1 << 13)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_46   (1 << 14)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_47   (1 << 15)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_48   (1 << 16)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_49   (1 << 17)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_50   (1 << 18)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_51   (1 << 19)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_52   (1 << 20)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_53   (1 << 21)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_54   (1 << 22)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_55   (1 << 23)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_56   (1 << 24)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_57   (1 << 25)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_58   (1 << 26)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_59   (1 << 27)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_60   (1 << 28)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_61   (1 << 29)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62   (1 << 30)
#  define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63   (1 << 31)

